# 3-1 나만의 데이터 만들기
### 해보세요! 시리즈와 데이터프레임 직접 만들기

In [1]:
import pandas as pd

In [2]:
#1 시리즈 만들기
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

In [5]:
#2 시리즈 생성 시 문자열을 인덱스로 지정하기
s = pd.Series(['Seunghwan Roh', 
               'Master of Pandas'], 
              index=['Person', 
                     'Who'])
s

Person       Seunghwan Roh
Who       Master of Pandas
dtype: object

In [8]:
#3 데이터프레임 만들기
scientists = pd.DataFrame({
    'Name': ['Seunghwan Roh', 'Dohyung Kim'],
    'Occupation': ['Reporter', 'Data Scientist'],
    'Born': ['1986-07-29', '1900-00-00'],
    'Age': [32, 42]}
)
scientists

            Name      Occupation        Born  Age
0  Seunghwan Roh        Reporter  1986-07-29   32
1    Dohyung Kim  Data Scientist  1900-00-00   42

In [13]:
#4 문자열을 인덱스로 지정하고 
scientists = pd.DataFrame(
    data={'Occupation': ['Reporter', 'Data Scientist'], 
          'Born': ['1986-07-29', '1900-00-00'], 
          'Died': ['Not yet', 'Maybe sooner or later'],
          'Age': [32, 42]},
    index=['Seunghwan Roh', 'Dohyung Kim'],
    columns=['Occupation', 'Age', 'Born', 'Died']
)
scientists

                   Occupation  Age        Born                   Died
Seunghwan Roh        Reporter   32  1986-07-29                Not yet
Dohyung Kim    Data Scientist   42  1900-00-00  Maybe sooner or later

In [19]:
#5 OrderedDict 클래스로 순서가 보장된 딕셔너리를 전달하기
from collections import OrderedDict

scientists = pd.DataFrame(OrderedDict([
    ('Name', ['Rosaline Franklin', 'William Gosset']),
    ('Occupation', ['Chemist', 'Statistician']),
    ('Born', ['1920-07-25', '1876-06-13']),
    ('Died', ['1958-04-16', '1937-10-16']),
    ('Age', [37, 61]),
]))
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

# 3-2 시리즈 다루기 - 기초
## 해보세요! 데이터프레임에서 시리즈 선택하기

In [20]:
#1 변수에 데이터프레임 준비하기
scientists = pd.DataFrame(
    data={'Occupation': ['Reporter', 'Data Scientist'], 
          'Born': ['1986-07-29', '1900-00-00'], 
          'Died': ['Not yet', 'Maybe sooner or later'],
          'Age': [32, 42]},
    index=['Seunghwan Roh', 'Dohyung Kim'],
    columns=['Occupation', 'Born', 'Died', 'Age']
)
scientists

                   Occupation        Born                   Died  Age
Seunghwan Roh        Reporter  1986-07-29                Not yet   32
Dohyung Kim    Data Scientist  1900-00-00  Maybe sooner or later   42

In [23]:
#2 loc 속성에 인덱스를 전달해 시리즈 선택하기
first_row = scientists.loc['Seunghwan Roh']
print(type(first_row))

<class 'pandas.core.series.Series'>

In [25]:
#3 Age 열에 정수형 리스트를 전달해도 시리즈를 출력해보면 자료형을 오브젝트로 인식한다
print(first_row)

Occupation      Reporter
Born          1986-07-29
Died             Not yet
Age                   32
Name: Seunghwan Roh, dtype: object

## 시리즈 속성과 메서드 사용하기 - index, vaules, keys
### 해보세요! index, values 속성과 keys 메서드 사용하기

In [27]:
#1 index 속성 사용하기
first_row.index

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [28]:
#2 values 속성 사용하기
print(first_row.values)

['Reporter' '1986-07-29' 'Not yet' 32]

In [34]:
#3 keys 메서드 사용하기
print(first_row.keys())

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [49]:
#4 keys 메서드 응용하기
first_row.keys()[0]

'Occupation'

In [50]:
first_row.values[0]

'Reporter'

## 시리즈의 기초 통계 메서드 사용하기
### 해보세요! 시리즈의 mean, min, max, std 메서드 사용하기

In [52]:
#1 Age 열 추출하기
ages = scientists['Age']
ages

Seunghwan Roh    32
Dohyung Kim      42
Name: Age, dtype: int64

In [54]:
#2 시리즈 구하는 데이터가 정수라면 통계 메서드 사용 가능
ages.mean(), ages.min(), ages.max(), ages.std()

(37.0, 32, 42, 7.0710678118654755)

#### 시리즈 메서드 정리
- append: 2개 이상의 시리즈 연결
- describe: 요약 통계량 계산
- drop_duplicate: 중복값이 없는 시리즈 반환
- dquals: 시리즈에 해당 값을 가진 요소가 있는지 확인
- get_values: 시리즈 값 구하기(values 속성과 동일)
- isin: 시리즈에 포함된 값이 있는지 확인
- min: 최솟값
- max: 최댓값
- mean: 산술 평균 반환
- median: 중간값 반환
- replace: 특정 값을 가진 시리즈 값을 교체
- sample: 시리즈에서 임의의 값을 반환
- sort_values: 값을 정렬
- to_frame: 시리즈를 데이터프레임으로 변환

# 3-3. 시리즈 다루기 - 응용
## 시리즈와 불린 추출
### 해보세요! 시리즈와 불린 추출 사용하기

In [66]:
#1 데이터 불러오기
scientists = pd.read_csv('data/scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [70]:
#2 통계 수치의 결괏값 확인하기
ages = scientists['Age']
print(ages.max())
print(ages.mean())

90
59.125

In [74]:
#3 불린 추출하기
print(ages[ages > ages.mean()])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [75]:
#4 결과 확인하기
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [76]:
#5 과정 3과 4를 합친 코드
manual_bool_values = [True, True, False, False, True, True, False, True]
print(ages[manual_bool_values])

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

## 시리즈와 브로드캐스팅
- 브로드캐스팅: 시리즈나 데이터프레임에 있는 모든 데이터에 대해 한 번에 연산하는 것

### 해보세요! 벡터와 스칼라로 브로드캐스팅 수행하기

In [79]:
#1 벡터로 연산하기
print(ages + ages)
print(ages * ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [81]:
#2 벡터와 스칼라 연산하기 
print(ages + 100)
print(ages * 2)

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64
0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [88]:
#3 길이가 서로 다른 벡터의 연산
print(pd.Series([1, 100]))
print(ages + pd.Series([1, 100]))

0      1
1    100
dtype: int64
0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [91]:
#4 sort_index로 데이터 정렬하기
rev_ages = ages.sort_index(ascending=False)
print(rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [92]:
#5 정렬 순서가 바뀌어도 연산은 인덱스 기준으로 수행한다
print(ages * 2)
print(ages + rev_ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

# 3-4 데이터프레임 다루기
### 해보세요! 불린 추출과 브로드캐스팅

In [93]:
#1 불린 추출하기
scientists = pd.read_csv('data//scientists.csv')
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [95]:
#2 bool 벡터로 연산하기(bool 벡터의 길이만큼만 연산한다)
scientists.loc[[True, False, True, True]]

                   Name        Born        Died  Age Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90      Nurse
3           Marie Curie  1867-11-07  1934-07-04   66    Chemist

In [97]:
#3 브로드캐스팅하기
# 정수 데이터에는 2를 곱하고 문자열 데이터는 2번 쓴다
print(scientists * 2)

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

# 3-5 시리즈와 데이터프레임의 데이터 처리하기
### 해보세요! 시리즈와 데이터프레임의 데이터 처리하기

In [98]:
#1 열의 자료형 바꾸기와 새로운 열 추가하기
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)

object
object

In [100]:
scientists.tail(2)

           Name        Born        Died  Age          Occupation
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [106]:
#2 날짜를 문자열로 저장한 데이터를 datetime 자료형으로 바꾸기
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
born_datetime, died_datetime

(0   1920-07-25
 1   1876-06-13
 2   1820-05-12
 3   1867-11-07
 4   1907-05-27
 5   1813-03-15
 6   1912-06-23
 7   1777-04-30
 Name: Born, dtype: datetime64[ns], 0   1958-04-16
 1   1937-10-16
 2   1910-08-13
 3   1934-07-04
 4   1964-04-14
 5   1858-06-16
 6   1954-06-07
 7   1855-02-23
 Name: Died, dtype: datetime64[ns])

In [107]:
#3 데이터프레임에 새로운 열로 추가하기
scientists['born_dt'], scientists['died_dt'] = (born_datetime, died_datetime)
scientists.tail(2)

,Name,Born,Died,Age,Occupation,born_dt,died_dt
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [109]:
#4 과학자들 얼마나 살았는지 계산하기
scientists['age_days_dt'] = scientists['died_dt'] - scientists['born_dt']
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [110]:
#5 시리즈, 데이터프레임 데이터 섞기
print(scientists['Age'])

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [118]:
import numpy as np

In [121]:
#6 시리즈, 데이터프레임 데이터 섞기
import random
random.seed(42)
random.shuffle(scientists['Age'])
scientists['Age']

0    61
1    37
2    45
3    41
4    66
5    77
6    56
7    90
Name: Age, dtype: int64

In [122]:
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,61,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,37,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,45,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,41,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,66,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,77,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,56,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,90,Mathematician,1777-04-30,1855-02-23,28422 days

In [124]:
#7 데이터프레임 열 삭제하기 - 열 확인
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

In [129]:
#8 drop 메서드로 Age 열 삭제하기
s_dropped = scientists.drop(['Age'], axis=1)
s_dropped.tail(2)

,Name,Born,Died,Occupation,born_dt,died_dt,age_days_dt
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

# 3-6 데이터 저장하고 불러오기
### 해보세요! 데이터를 피클, CSV, TSV 파일로 저장하고 불러오기

In [131]:
#1 피클로 저장하기
names = scientists["Name"]
names.to_pickle('./output/scientists_names_series.pickle')

In [132]:
#2 데이터프레임을 피클로 젖아하기
scientists.to_pickle('./output/scientists_df.pickle')

In [134]:
#3 피클은 바이너리 형태의 오브젝트이므로 반드시 read_pickle 메서드로 읽어들인다
scientists_names_from_pickle = pd.read_pickle('./output/scientists_names_series.pickle')
print(scientists_names_from_pickle)
scientists_from_pickle = pd.read_pickle('./output/scientists_df.pickle')
print(scientists_from_pickle)

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object
                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   61             Chemist
1        William Gosset  1876-06-13  1937-10-16   37        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   45               Nurse
3           Marie Curie  1867-11-07  1934-07-04   41             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   66           Biologist
5             John Snow  1813-03-15  1858-06-16   77           Physician
6           Alan Turing  1912-06-23  1954-06-07   56  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   90       Mathematician

     born_dt    died_dt age_days_dt
0 1920-07-25 1958-04-16  13779 days
1 1876-06-13 1937-10-16  22404 days
2 1820-05-12 1910-08-13  32964 days
3 1867-11-07 1934-07-04  24345 days
4 1907-05-27 1964-04-14  20777 days
5 1813-03-15 1858-06-16  16529 days
6 1912-06-23 1954-06-07  15324 days
7 1777-04-30 1855-02-23  28422 days

In [135]:
#4 csv 파일과 tsv 파일로 저장하기
# 그림 생략

In [136]:
#5 csv 파일과 tsv 파일로 저장하기
names.to_csv('./output/scientist_names_series.csv')
scientists.to_csv('./output/scientists_df.txv', sep='\t')

### 알아두면 좋아요! 시리즈와 데이터프레임을 엑셀 파일로 저장하기

In [139]:
names_df = names.to_frame()

In [140]:
names_df

                   Name
0     Rosaline Franklin
1        William Gosset
2  Florence Nightingale
3           Marie Curie
4         Rachel Carson
5             John Snow
6           Alan Turing
7          Johann Gauss

In [141]:
import xlwt
import openpyxl

In [142]:
names_df.to_excel('./output/scientists_names_series_df.xls')
names_df.to_excel('./output/scientists_names_series_df.xlsx')